/**最大关卡*/
var levelMax:number = 10;
/**当前关卡*/
var levelCurr:number = 1;

var leveldata:number[] = [50, 80, 100, 120, 140]

// 生命力
var chanceMax = 2;

// 累计分数
var score = 1000;
var level = 1;
var target = 4000;

// 速率
var rate = 0.5;

// 速度衰减
var alpha = 0.9;

// 最大时钟时间
var maxTime = 20;


/** 界面数据 */
// 线条和墙壁
var lines = [
    [0,  70, 490, 70],
    [490,70, 710, 205],
    [490, 70, 710, 205],
    [710, 205, 710, 524],
    [710, 524, 446, 695],
    [446, 695, 466, 723],
    [466, 723, 710, 564],
    [710, 564, 710, 1280],
    [0, 70, 0, 1280],
    [120, 902, 361, 902],
    [361, 902, 361, 934],
    [361, 934, 120, 939],
    [120, 902, 120, 939],
    [710, 1280, 0, 1280]
].map(l => [{ x: l[0], y: l[1] }, { x: l[2], y: l[3] }] );

